<font color="blue">To use this notebook on Colaboratory, you will need to make a copy of it. Go to File > Save a Copy in Drive. You can then use the new copy that will appear in the new tab.</font>

# Practice Notebook: Data Cleaning with Python - Duplicates

## 4. Duplicates

#### <font color="blue">Pre-requisites</font>

In [ ]:
# Pre-requisite 1
# ---
# Importing pandas library
# ---
# OUR CODE GOES BELOW
# 
import pandas as pd

#### <font color="blue">Examples</font>

##### <font color="blue">Example 1</font>

In [ ]:
# Example 1
# --- 
# Finding duplicate records
# -> Duplicate records are repeated records in a dataset.
# ---
# Dataset url = http://bit.ly/SampleDataset
# ---
# OUR CODE GOES BELOW
# 
df = pd.read_csv('http://bit.ly/SampleDataset')

# Previewing our dataset 
# ---
# 
df

                NAME               CITY  ... ACCOUNT B  TOTAL ACCOUNT
0          Adi Dako          LISBON      ...      4340           6730
1          John Paul          LONDON     ...     34334          38834
2        Cindy Jules          Stockholm  ...      5504           8949
3      Arthur Kegels           BRUSSELS  ...      8999            300
4      Freya Bismark             Berlin  ...     19000          26000
5         Rena Filip       Brasilia      ...      3999           3450
6        Cindy Jules          Stockholm  ...      5504           8949
7          John Paul          LONDON     ...      2300           6800

[8 rows x 8 columns]

In [ ]:
# Determining the shape of our dataset (records/instances, columns/variables)
# ---
# 
df.shape

(8, 8)

In [ ]:
# We can then identify which observations are duplicates
# through the duplicates function and sum() to know how many
# duplicate records there are.
# In our case we don't have any duplicate records.
# Normally duplicate records are dropped from the dataset.
# ---
#
df[df.duplicated()]

Empty DataFrame
Columns: [NAME, CITY, COUNTRY, HEIGHT, WEIGHT, ACCOUNT A, ACCOUNT B, TOTAL ACCOUNT]
Index: []

In [ ]:
# Finding the no. of duplicates
# ---
# 
sum(df.duplicated())

0

##### <font color="blue">Example 2</font>

In [ ]:
# Example 2
# ---
# Dropping duplicate columns
# ---
# Dataset = http://bit.ly/SampleDataset
# ---
# OUR CODE GOES BELOW
# 

# In our previous dataset, if there were duplicates we
# could have dropped the through the use of the drop_duplicates() function 
# as shown in this example 
# ---
# 
df_duplicates = df.drop_duplicates()

##### <font color="blue">Example 3</font>

In [ ]:
# Example 3
# ---
# Dropping duplicates in a specific column
# ---
# Dataset url = http://bit.ly/SampleDataset
# ---
#

# We can also consider records with repeated variables/columns 
# as duplicates and deal with them. For example, we can 
# identify duplicates in our dataset based on HEIGHT
# ---
#  
duplicates_df = df[df.duplicated(['HEIGHT'])] 
duplicates_df

          NAME       CITY         COUNTRY  ...  ACCOUNT A  ACCOUNT B  TOTAL ACCOUNT
6  Cindy Jules  Stockholm          Sweden  ...     3445.0       5504           8949
7    John Paul  LONDON     UNITED KINGDOM  ...     4500.0       2300           6800

[2 rows x 8 columns]

In [ ]:
# Then dropping the duplicates as shown below.
# NB: We will save them in a new dataframe object which will contain our unique dataframe
# --- 
# 
unique_df = df.drop_duplicates(['HEIGHT'])

# Determining the size of our new dataset 
# We note that the two records were dropped from our original dataset
# ---
# 
unique_df.shape

(6, 8)

#### <font color="green">Challenges</font>

##### <font color="green">Challenge 1</font>

In [ ]:
# Challenge 1
# ---
# Question: Find outliers in the following dataset.
# ---
# Dataset url = http://bit.ly/StaffDataset
# ---
#

##### <font color="green">Challenge 2</font>

In [ ]:
# Challenge 2
# ---
# Question: Deal with outliers in the given dataset.
# ---
# Dataset url = http://bit.ly/StaffDataset
# ---
#